Catalogs/НастройкиСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиСоответствий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИсполнительныхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсполнительныхЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗалогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредиторов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолжников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговыхОбязательств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоДолжникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКонтрагентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКредиторам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДолжники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольКонтрагенты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольКредиторы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНазначенийСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаСоответствийКонтакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТелефонаПоУмолчанию</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиСоответствий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка	
		Таблица = ЭтаФорма.ВладелецФормы.Объект.НастройкаСоответствий; 
		
		ТаблицаКонтакты = ЭтаФорма.ВладелецФормы.Объект.НастройкаСоответствийКонтакты; 
		
		Объект.ТипДоговоров = ЭтаФорма.ВладелецФормы.Объект.ТипДоговоров;
		Объект.ТипДолговыхОбязательств = ЭтаФорма.ВладелецФормы.Объект.ТипДолговыхОбязательств;
		Объект.ТипДолжников = ЭтаФорма.ВладелецФормы.Объект.ТипДолжников;
		Объект.ТипЗалогов = ЭтаФорма.ВладелецФормы.Объект.ТипЗалогов;
		Объект.ТипИсполнительныхДокументов = ЭтаФорма.ВладелецФормы.Объект.ТипИсполнительныхДокументов;
		Объект.ТипКонтрагентов = ЭтаФорма.ВладелецФормы.Объект.ТипКонтрагентов;
		Объект.ТипКредиторов = ЭтаФорма.ВладелецФормы.Объект.ТипКредиторов;
		Объект.ТипУслуг = ЭтаФорма.ВладелецФормы.Объект.ТипУслуг;
		
		Объект.УчетПоДО = ЭтаФорма.ВладелецФормы.Объект.УчетПоДО;
		Объект.УчетПоИД = ЭтаФорма.ВладелецФормы.Объект.УчетПоИД;
		Объект.УчетПоЗ = ЭтаФорма.ВладелецФормы.Объект.УчетПоЗ;
		Объект.УчетПоД = ЭтаФорма.ВладелецФормы.Объект.УчетПоД;
		Объект.УчетПоУ = ЭтаФорма.ВладелецФормы.Объект.УчетПоУ;
		Объект.УчетПоДолжникам = ЭтаФорма.ВладелецФормы.Объект.УчетПоДолжникам;
		Объект.УчетПоКредиторам = ЭтаФорма.ВладелецФормы.Объект.УчетПоКредиторам;
		Объект.УчетПоКонтрагентам = ЭтаФорма.ВладелецФормы.Объект.УчетПоКонтрагентам;  
		
		Объект.КонтрольД = ЭтаФорма.ВладелецФормы.Объект.КонтрольД;
		Объект.КонтрольДО = ЭтаФорма.ВладелецФормы.Объект.КонтрольДО;
		Объект.КонтрольЗ = ЭтаФорма.ВладелецФормы.Объект.КонтрольЗ;
		Объект.КонтрольДолжники = ЭтаФорма.ВладелецФормы.Объект.КонтрольДолжники;
		Объект.КонтрольИД = ЭтаФорма.ВладелецФормы.Объект.КонтрольИД;
		Объект.КонтрольКонтрагенты = ЭтаФорма.ВладелецФормы.Объект.КонтрольКонтрагенты;
		Объект.КонтрольКредиторы = ЭтаФорма.ВладелецФормы.Объект.КонтрольКредиторы;
		Объект.КонтрольУ = ЭтаФорма.ВладелецФормы.Объект.КонтрольУ;
				
		ЗаполнитьТаблицу(Таблица, ТаблицаКонтакты);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(Таблица, ТаблицаКонтакты)
	Объект.НастройкаСоответствий.Загрузить(Таблица.Выгрузить());	
	Объект.НастройкаСоответствийКонтакты.Загрузить(ТаблицаКонтакты.Выгрузить());	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("НастройкиСоответствийФормаЭлементаЗакрыть",Объект.Ссылка);
КонецПроцедуры
